{
  "architectures": [
    "Qwen3MoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_implementation": "sdpa",
  "bos_token_id": null,
  "decoder_sparse_step": 1,
  "dtype": "bfloat16",
  "eos_token_id": null,
  "hidden_act": "silu",
  "hidden_size": 704,
  "initializer_range": 0.02,
  "intermediate_size": 2816,
  "max_position_embeddings": 1000000,
  "mlp_only_layers": [],
  "model_type": "qwen3_moe",
  "moe_intermediate_size": 2816,
  "norm_topk_prob": false,
  "num_attention_heads": 16,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 8,
  "num_key_value_heads": 8,
  "num_local_experts": 8,
  "output_router_logits": false,
  "pad_token_id": null,
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "use_cache": false,
  "use_sliding_window": false,
  "vocab_size": 50257
}
